app/controllers/home_controller.rb

SELECT "categories".* FROM "categories" LIMIT ?  [["LIMIT", 4]]
---
  def index
     @main_categories = Category.take(4)